import styles from './SpecialtiesGrid.module.css';

export const data = [
  {
    icon: '💻',
    title: 'Программирование',
    text: 'Обучение с упором на практику и реальные задачи',
    small: 'Срок обучения: 3 года',
  },
  {
    icon: '💻',
    title: 'Программирование',
    text: 'Обучение с упором на практику и реальные задачи',
    small: 'Срок обучения: 3 года',
  },
  {
    icon: '💻',
    title: 'Программирование',
    text: 'Обучение с упором на практику и реальные задачи',
    small: 'Срок обучения: 3 года',
  },
  {
    icon: '💻',
    title: 'Программирование',
    text: 'Обучение с упором на практику и реальные задачи',
    small: 'Срок обучения: 3 года',
  },
  {
    icon: '💻',
    title: 'Программирование',
    text: 'Обучение с упором на практику и реальные задачи',
    small: 'Срок обучения: 3 года',
  },
  {
    icon: '💻',
    title: 'Программирование',
    text: 'Обучение с упором на практику и реальные задачи',
    small: 'Срок обучения: 3 года',
  },
  {
    icon: '💻',
    title: 'Программирование',
    text: 'Обучение с упором на практику и реальные задачи',
    small: 'Срок обучения: 3 года',
  },
  {
    icon: '💻',
    title: 'Программирование',
    text: 'Обучение с упором на практику и реальные задачи',
    small: 'Срок обучения: 3 года',
  },
  {
    icon: '💻',
    title: 'Программирование',
    text: 'Обучение с упором на практику и реальные задачи',
    small: 'Срок обучения: 3 года',
  }
]

export default function SpecialtiesGrid() {
  return (
    <div className={styles.container}>
      <div className={styles.grid}>
        {
          data.map((item) => (
            <div key={item.title} className={styles.cell}>
              <div className={styles.icon}>{item.icon}</div>
              <h1 className={styles.title}>{item.title}</h1>
              <h2 className={styles.text}>{item.text}</h2>
              <p className={styles.small}>{item.small}</p>
            </div>
          ))
        }
      </div>
    </div>
  );
}